# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# CLI tools
brew "git"
brew "stow"
brew "zsh"
brew "vim"
brew "neovim"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "jq"
brew "wget"
brew "curl"
brew "bat"
brew "exa"
brew "mas" # Mac App Store CLI
brew "htop"
brew "btop"
brew "lazygit"
brew "tree"
brew "dircolors" # For terminal colors

# Development
brew "node"
brew "python"
brew "go"
brew "docker"

# Casks (Applications)
cask "iterm2"
cask "visual-studio-code"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "spotify"
cask "rectangle" # Window management
cask "alfred"
cask "docker"

# Fonts
cask "font-fira-code"
cask "font-hack-nerd-font"

# Mac App Store Apps
# These can be found by running: mas list
# mas "Xcode", id: 497799835
# mas "1Password", id: 1333542190
# Add your preferred Mac App Store apps here
