# ============================================================================
# Homebrew Bundle File
# ============================================================================

# ============================================================================
# Third-party Taps
# ============================================================================
tap "andreybleme/lazycontainer", "https://github.com/andreybleme/lazycontainer"
tap "charmbracelet/tap"
tap "clintmod/formulas"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "openhue/cli"
tap "supabase/tap"
tap "vectordotdev/brew"

# ============================================================================
# Core System Tools & Utilities
# ============================================================================
brew "bash"
brew "coreutils"
brew "curl"
brew "findutils"
brew "gnu-sed"
brew "moreutils"
brew "stow"
brew "watch"
brew "wget"

# ============================================================================
# Shell & Terminal Enhancement
# ============================================================================
brew "starship"
brew "tmux"
brew "zsh"
brew "zsh-completions"

# ============================================================================
# Text Processing & Search
brew "ack"
brew "bat"
brew "ccze"
brew "fzf"
brew "gron"
brew "jq"
brew "ripgrep"

# ============================================================================
# File Management & Navigation
# ============================================================================
brew "eza"
brew "lf"
brew "superfile"
brew "tree"

# ============================================================================
# System Monitoring & Performance
# ============================================================================
brew "bottom"
brew "btop"
brew "ctop"
brew "duf"
brew "gotop"
brew "htop"

# ============================================================================
# Development Tools
# ============================================================================

# Version Control
brew "gh"
brew "git"
brew "git-delta"
brew "diff-so-fancy"
brew "tig"

# Programming Languages & Runtimes
brew "go"
brew "node"
brew "python"

# Package Managers
brew "mas"
brew "pnpm"

# Code Quality & Linting
brew "eslint"
brew "golangci-lint"
brew "jsonlint"
brew "yamllint"

# Database Tools
brew "golang-migrate"
brew "libpq"
brew "pgcli"
brew "sqlc"

# Go Development
brew "delve"
brew "golang-migrate"
brew "golangci-lint"

# ============================================================================
# DevOps & Infrastructure
# ============================================================================

# Containerization
brew "docker-compose"
brew "docker-credential-helper"
brew "lazydocker"
brew "podman"

# Configuration Management
brew "ansible"
brew "ansible-lint"

# Monitoring & Observability
brew "rrdtool"

# ============================================================================
# Networking & Security
# ============================================================================
brew "doggo"
brew "gping"
brew "grepcidr"
brew "httpie"
brew "ipcalc"
brew "iperf"
brew "iperf3"
brew "iproute2mac"
brew "masscan"
brew "mtr"
brew "nmap"
brew "prettyping"
brew "speedtest-cli"
brew "ssh-audit"
brew "ssh-copy-id"
brew "sshuttle"
brew "subnetcalc"
brew "tailscale"
brew "telnet"
brew "testssl"
brew "whois"

# ============================================================================
# Security & Privacy
# ============================================================================
brew "gnupg"
brew "gopass"
brew "pinentry-mac"
brew "step"

# ============================================================================
# Media & Content
# ============================================================================
brew "mpv"

# ============================================================================
# Documentation & Writing
# ============================================================================
brew "glow"
brew "hugo"
brew "mdbook"

# ============================================================================
# Productivity & Utilities
# ============================================================================
brew "ccat"
brew "dockutil"
brew "expect"
brew "fswatch"
brew "m-cli"
brew "minicom"
brew "neovim"
brew "syncthing", restart_service: :changed
brew "vim"

# ============================================================================
# System Dependencies & Libraries
# ============================================================================
brew "glib"
brew "gobject-introspection"
brew "guile"
brew "icu4c@76"
brew "libass"
brew "libpng"
brew "pkgconf"
brew "python-tabulate"

# ============================================================================
# Third-party Formula Packages
# ============================================================================
brew "andreybleme/lazycontainer/lazycontainer"
brew "charmbracelet/tap/mods"
brew "clintmod/formulas/macprefs"
brew "jesseduffield/lazygit/lazygit"
brew "openhue/cli/openhue-cli"
brew "supabase/tap/supabase"
brew "vectordotdev/brew/vector"

# Additional tools
brew "jira-cli"

# Network Engineering Tools
brew "sipcalc" # IP calculator

# Go Development Tools
brew "air" # Live reloading for Go applications
brew "goreleaser" # Go project release tool
brew "gotestsum" # Go test runner
brew "mockery" # Mock generation tool

# TypeScript/Vue Tools
brew "typescript" # TypeScript compiler
brew "vue-cli" # Vue.js CLI 
brew "vue-language-server" # Language server for Vue.js
brew "vite" # Vue.js testing framework

# ============================================================================
# GUI Applications (Casks)
# ============================================================================

# Development & Text Editors
cask "zed"

# System Utilities
cask "betterdisplay"
cask "raycast"
cask "spectacle"

# File Management
cask "marta"

# Cloud Storage & Sync
cask "dropbox"

# Communication
cask "zoom"

# Media & Graphics
cask "drawio"

# Hardware-specific
cask "logitech-camera-settings"

# Fonts
cask "font-hack-nerd-font"

# ============================================================================
# Mac App Store Applications
# ============================================================================
mas "Amphetamine", id: 937984704
mas "Tailscale", id: 1475387142
mas "WireGuard", id: 1451685025
